const quizzes = {
    "웹시스템개론": [
        {q: "고급 언어로 볼 수 없는 것은?",o: ["코블", "어셈블리어", "파스칼", "C"],a: 1},
        {q: "고급언어에 관한 설명으로 옳은 것은?",o: ["고급 언어는 저급 언어와는 달리 사람이 이해하기 쉬운 언어이다", "기계어, 어셈블리어가 고급 언어의 대표적인 언어이다", "ADD, STA, LDA 등은 고급 언어인 어셈블리어에서 사용한다.", "레지스터의 종류와 이용 방법 등을 이해해야만 a: 0},
        {q: "프로그램 개발 환경에 대한 설명으로 옳지 않은 것은?", o: ["프로그램을 개발하려면 개발 도구가 필요하다", "컴파일러는 텍스트 문서,프로그램,데이터 파일 등을 작성할때 사용하는 기본적인 프로그램이다.", "디버거란 프로그램 오류를 쉽게 찾아 수정할 수 있도록 도와주는 프로그램이다.", "링커a: 1 },
        {q: "인터프리터 언어로만 구성된 것은?", o: [" C, 파스칼", "베이직, C", " C++, 자바", "베이직, 파이썬"], a: 3},
        {q: "데이터베이스의 특징으로 옳지 않는 것은?",o: ["통합된 데이터", "관련 있는 데이터", "동시 접근, 무결성", "중복된 데이터"],a: 3},
        {q: "오라클의 소유이며, 대표적인 오픈 소스 DBMS로 인기가 좋은 데이터베이스 관리 시스템은?", o: ["MySQL", "ORACLE", "SQL Server", "PowerBuilder"], a: 0},
        {q: "관계에 대한 연산에 해당하지 않는 것은?",o: [" insert", " delete", " merge", "select"],a: 2 },
        {q: "데이터베이스의 부류가 다른 것은?", o: ["오라클", "몽고 DB", "mySQL", "mariaDB"],a: 1 },
        {q: "두 개 이상의 LAN을 서로 연결하며 하나의 네트워크로 만들어주는 것은?", o: ["라우터", "게이트웨이", "브리지", "허브"],a: 2},
        {q: "원어의 연결이 옳지 않은 것은?",o: ["WWW – World Wide Web", "HTTP – Hyper Text Transfer Protocol", "SMTP – Simple Mail Transfer Protocol", " FTP – Folder Transfer Protocol"],a: 3},
        {q: "OSI 7개 계층 중 전송하는 정보의 표현 방식을 관리하고 암호화하거나 데이터를 압축하는 역할을 하는 계층은?",o: ["표현", "응용", "세션", "네크워크"],a: 0 },
        {q: "OSI 모델의 계층 중 인접하는 두 개의 노드 간의 전송을 책임지는 계층은?", o: ["데이터 링크", "세션", "표현", "응용"], a: 0},
        {q: "사물이 연결되어 정보가 생성, 수집되고 다시 재가공, 공유, 활용되는 사회는?",o: ["기계화 사회", "초현실 사회", " 익명 사회", " 초연결 사회"], a: 3 },
        {q: "산업혁명의 주요 키워드로 옳지 않은 것은?",o: ["1차 산업혁명: 증기기관", "2차 산업혁명: 내연기관", " 3차 산업혁명: 초지능", "4차 산업혁명: 빅데이터"], a: 2},
        {q: "컴퓨팅사고의 4가지는?", o: ["융합, 분배, 추상화, 알고리즘", "분해, 패턴인식, 추상화, 알고리즘", "분해, 패턴인식, 구체화, 알고리즘", "융합, 패턴인식, 구체화, 알고리즘"], a: 1},
        {q: "기계 및 물체, 전자 제품 또는 동물 등의 모든 사물이 네트워크에 연결되어 유일하게 식별될 수 있으며, 스스로 데이터를 전송할 수 있는 체계적인 장치로 연결하여 인간과 컴퓨터의 상호작용이 되도록 하는 시스템은?", o: [" 빅데이터", "IoT", " 인공지능", "핀테크"], a: 1 },
        {q: "컬러 영상에서 JPEG 생성시 필요하지 않은 색 요소는?", o: ["Y", "B", "Cb", "Cr"], a: 1 },
        {q: "JPEG과 관련이 없는 것은?",o: ["무손실압축", "반복길이코딩", "이산 코사인 변환", "혼합압축"],a: 0 },
        {q: "파일 형식에서 나머지 3개와 다른 것은?",o: ["WMV", "MOV", "JPG", "MPG"],a: 2 },
        {q: "오디오 파일만으로 이루어진 것은?",o: ["오그보비스-MPG", "MPG-JPG", "WAV-AV", "MP3-JPG"], a: 2},
        {q: "사용자 A도 모르게 사용자 C가 사용자 B에게 A가 정보를 전송한 것처럼 전송하는 것은?",o: ["정보 변조", "정보 위조", "차단", "정보 가로채기"],a: 1 },
        {q: "정보보안 수칙에서 올바른 암호의 바른 사용 방법이 아닌 것은?",o: ["분실을 막기 위해서 추측이 가능한 암호를 이용한다.", "가능하면 길게 만든다.", "특수문자, 영문자, 숫자를 조합한다.", "적어도 3개월 마다 수정한다."],a: 0 },
        {q: "바이러스 종류 중 성격이 다른 하나는?", o: ["부트 바이러스", "파일 바이러스", "부트/파일 바이러스", "PC 바이러스"], a: 3 },
        {q: "암호화의 반대로, 암호문에서 평문으로 변환하는 것을 무엇이라 하는가?", o: ["대칭화", "복호화", "공개키", "비밀키"], a: 1 },
    ],
    "컴퓨터와정보": [
        {q: "엑셀에서 '부분합' 기능을 실행하기 전에, 반드시 선행되어야 데이터가 엉키지 않고 그룹별로 올바르게 계산되는 작업은 무엇인가?",o: ["정렬", "필터 적용", "차트 삽입", "글꼴 변경"],a: 0},
        {q: "부분합 대화상자에서 이미 계산된 합계 외에 추가로 '평균'을 구하려고 할 때, 기존의 합계가 사라지지 않도록 하기 위해 반드시 해체해야 하는 체크박스 옵션은?",o: ["그룹 사이에서 페이지 나누기", "데이터 아래에 요약 표시", "새로운 값으로 대치", "모두제거"],a: 2},
        {q: "부분합을 실행하면 워크시트 왼쪽(행 번호 왼쪽)에 [1], [2], [3]과 같은 번호와 ➖, ➕ 기호가 생겨나는데, 이를 클릭하여 데이터를 접거나 펼쳐 볼 수있는 기능의 이름은?",o: ["슬라이서(Slicer)", "윤곽(Outline)", "스파크라인", "유효성 검사"],a: 1},
        {q: "다음 중 '부분합' 기능을 통해 자동으로 계산할 수 있는 함수로 엑셀 메뉴 목록에 없는 것은?", o: ["순위", "개수", "합계", "평균"],a: 0 },
        {q: "엑셀의 [데이터] 탭에서 [필터] 단추를 누르면 각 열의 제목(헤더) 옆에 '역삼각형(▼)' 모양의 버튼이 생기며, 이를 클릭하여 손쉽게 데이터를 걸러낼 수 있는 기능은?", o: ["고급 필터", "피벗 테이블", "조건부 서식", "자동 필터"],a: 3},
        {q: "조건이 복잡할 때 사용하는 '고급 필터'에서, '부서가 영업팀' 이면서(AND) '직급이 과장'인 직원을 찾으려 한다. 이때 조건 범위(Criteria)는 어떻게 작성해야 하는가?",o: ["조건을 서로 다른 행(줄)에 입력한다.", "조건 앞에 쉼표(,)를 입력한다.", "조건 사이에 빈 열을 하나 둔다.", "조건을 같은 행(줄)에 나란히 입력한다."], a: 3 },
        {q: "다음 중 '자동 필터'에서는 할 수 없고, '고급 필터' 기능을 사용해야만 가능한 작업은?",o: ["숫자 데이터에서 상위 10개 항목만 보기", "오름차순 정렬하기", "특정 단어가 포함된 텍스트 찾기", "터링된 결과를 원본 위치가 아닌 '다른 장소에 복사'하기"], a: 3 },
        {q: "텍스트 필터나 고급 필터 조건에서, 글자 수에 상관없이 '모든 문자열'을 의미하는 만능 문자(와일드카드)는?",o: ["?(물음표)", "#(샵)", "@(골뱅이)", "*(별표/에스터리스크)"],a: 3},
        {q: "많은 양의 데이터를 다양한 관점에서 요약, 분석, 탐색하고 보고서 형태로 쉽게 만들 수 있는 엑셀의 기능으로,행과 열의 위치를 자유롭게 바꿀 수(Pivot) 있는 도구는?",o: ["차트(Chart)", "매크로(Macro)", "부분합", "피벗 테이블(Pivot Table)"],a: 3 },
        {q: "피벗 테이블 필드 작업 창에는 4가지 영역이 있습니다. 다음 중 '매출액', '수량'과 같이 계산이 가능한 수치  데이터를 드래그하여 합계나 평균을 구하는 영역은?",o: ["필터 영역", "값 영역", "행 영역", "열 영역"], a: 1},
        {q: "피벗 테이블에서 날짜 데이터가 일(Day) 단위로 되어 있을 때, 이를 '월(Month)'이나 '분기(Quarter)' 단위로 묶어서 요약하거나, 점수를 '10점 단위'로 묶어서 보고 싶을 때 사용하는 기능은?",o: ["새로 고침", "그룹", "슬라이서", "정렬"],a: 1},
        {q: "피벗 테이블의 '값' 영역에 데이터를 넣었을 때, 엑셀이 기본적으로 적용하는 계산 함수에 대한 설명으로 옳은 것은",o: ["사용자가 함수를 변경할 수 없다.", "모든 데이터는 무조건 '최대값'으로 계산된다.", "모든 데이터는 무조건 '평균'으로 계산된다", "숫자 데이터는 '합계',문자 데이터는 '개수'가 기본이다"], a: 3 },
        {q: "엑셀에서 '90점 이상인 점수는 빨간색으로 표시', '평균 미만인 셀은 회색으로 표시'와 같이, 특정한 규칙을 만족하는 셀에만 서식(색상, 글꼴 등)을 자동으로 적용하는 기능은?",o: ["유효성 검사", "필터", "셀 스타일", "조건부 서식"],a: 3 },
        {q: "조건부 서식의 기능 중 하나로, 셀 안에 있는 숫자의 크기에 비례하여 색칠된 막대의 길이를 다르게 표시함으로써 수치를 시각적으로 비교할 수 있게 해주는 것은?",o: ["색조", "아이콘 집합", "데이터 막대", "스파크라인"], a: 2},
        {q: "일반적인 데이터 범위를 엑셀의 '표(Table)' 기능으로 변환([삽입] > [표] 또는 단축키 Ctrl+T)했을 때의 장점으로 적절하지 않은 것은?",o: ["필터 단추가 자동으로 생성된다.", "데이터가 추가되면 표 범위와 서식이 자동으로 확장된다.", "셀을 병합하고 가운데 맞춤을 자유롭게 할 수 있다.", "줄무늬 행(밴드 무늬) 서식이 자동으로 적용되어 가독성이 좋아진다."],a: 2 },
        {q: "엑셀 '표'의 맨 아래쪽에 자동으로 합계, 평균, 개수 등을 계산해주는 행을 추가하고 싶을 때, [테이블 디자인] 탭에서 체크해야 하는 옵션은?",o: ["필터 단추", "첫째 열", "요약 행", "머리글 행"], a: 2},
        {q: "다음 중 특정 기간 동안의 데이터 변화 추세나 '시간의 흐름'에 따른 연속적인 값의 변화를 보여주기에 가장 적합한 차트 유형은?",o: ["도넛형 차트(Doughnut Chart)", "꺾은선형 차트(Line Chart)", "방사형 차트(Radar Chart)", "원형 차트(Pie Chart)"],a: 1 },
        {q: "엑셀의 기능 중 하나로, 하나의 '셀(Cell)' 안에 들어가는 작은 차트를 말하며, 데이터의 패턴이나 추세를 텍스스트로 직접 표시하여 정확한 정보를 전달하는 요소는?",o: ["슬라이서", "데이터 막대", "피벗 차트", "스파크라인"],a: 3},
        {q: "차트의 구성 요소 중, 막대 그래프의 높이나 꺾은선 그래프의 점 위치에 구체적인 '수치(값)'를 텍스트로 직접 표시하여 정확한 정보를 전달하는 요소는?",o: ["추세", "범례", "축 제목", "데이터 레이블"],  a: 3},
        {q: "피벗 테이블을 원본으로 하여 만들어진 '피벗 차트'에 대한 설명으로 옳지 않은 것은?",o: ["피벗 테이블의 데이터를 필터링하면 피벗 차트에도 즉시 반영된다.", "슬라이서를 연결하여 피벗 차트를 컨트롤할 수 있다", "피벗 테이블과 피벗 차트는 서로 연결되어 있지 않아 각각 따로 업데이트해야 한다.", "피벗 차트에는 데이터를 필터링할 수 있는 필드 단추가 표시된다.a: 2 },
        {q: "데이터들이 평균값으로부터 얼마나 멀리 떨어져 있는지를 나타내는 수치로, 이 값이 작을수록 데이터가 평균 근처에 모여 있어 '고르다'라고 표현하는 통계값은?",o: ["SUM", "MODE", "MEDIAN", "STANDARD DEVIATION"],a: 3},
        {q: "셀에 데이터를 입력할 때 '1부터 100 사이의 정수'만 입력되도록 제한하거나, 미리 정해둔 '목록' 중에서만 선택하게 하여 오타나 오류 입력을 방지하는 기능은?",o: ["텍스트 나누기", "데이터 통합", "데이터 유효성 검사", "가상 분석"],a: 2},
        {q: "다음 중 데이터 집합에서 3번째로 큰 값을 구하고 싶을 때 사용하는 함수는?", o: ["MAX", "LARGE", "RANK", "SMALL"],a: 1},
        {q: "특정 학생의 점수가 전체 학생들 중에서 몇 등인지 순위를 구하고 싶을 때 사용하는 함수는? (동점자가 있을 경우 같은 등수로 표시)",o: ["VLOOKUP", "RANK.EQ", "AVERAGE", "COUNTIF"],a: 1},
        {q: "결과값은 알고 있지만 그 결과를 얻기 위해 필요한 '입력값'이 무엇인지 모를 때, 역으로 추적하여 하나의 입력값을 찾아내는 엑셀의 가상 분석 도구는?",o: ["목표값 찾기(Goal Seek)", "부분합", "데이터 표", "시나리오 관리자"], a: 0},
        {q: "[목표값 찾기] 대화상자에는 3가지 입력 항목이 있습니다. 다음 중 각 항목에 대한 설명으로 올바른 것은?",o: ["수식 셀(Set Cell): 반드시 숫자가 입력되어 있어야 한다.", "찾는 값(To value): 내가 최종적으로 원하는 목표 수치를 직접 입력한다.", "찾는 값: 셀 주소를 클릭하여 입력해야 한다.", "값을 바꿀 셀(By changing cell): 결과값이 들어있는 셀을 선택한다."],a: 1},
        {q: "다음 중 '목표값 찾기'와 구별되는 '시나리오 관리자'만의 특징으로 가장 적절한 것은?",o: ["한 번에 하나의 변수 값만 변경하여 결과를 예측할 수 있다.", "반드시 수식이 없어도 작동한다.", " 최대 32개까지의 변경 변수(입력값)를 지정하여 다양한 경우의 수를 비교할 수 있다.", "결과값을 지정하면 입력값을 자동으로 찾아준다"],a: 2},
        {q: "작성된 여러 시나리오(예: 낙관적, 비관적, 현재)를 한눈에 비교하기 위해 별도의 시트에 보고서를 만들려고 한다. 이때 [시나리오 관리자] 창에서 클릭해야 하는 버튼은?",o:["추가","요약","표시","병합"], a:1},
    ],
    "C언어": [
        { q: "컴퓨터에 작업을 시키려고 명령어를 모아 놓은 것을?", a: "함수" },
        { q: "프로그램을 만드는 작업을?", a: "프로그래밍" },
        { q: "컴퓨터가 이해할 수 있는 언어로, 이진코드(0과1)로 이루어진 언어를?", a: "기계어" },
        { q: "프로그래밍 언어로 작성된 소스 코드를 컴퓨터가 실행할 수있는 기계어로 번역하여 실행파일을 만드는 프로그래밈을?", a: "컴파일러" },
        { q: "C언어로 작성한 소스 파일 확장자는?", a: ".c" },
        { q: "C언어의 소스 코드에서 메모역할을 하는것은?", a: "주석" },
        { q: "라이브라리에서 서로 관련있는 함수를 모아놓은 파일을?", a: "헤더파일" },
        { q: "printf() 함수처럼 입출력에 관련된 라이브러리를 모아놓은 헤더파일의 이름은?", a: ".h" },
        { q: "printf() 함수처럼 줄바꿈에 해당하는 제어문자는?", a: "\\n" },
        { q: "printf() 함수처럼 탭에 해당하는 제어문자는?", a: "\\t" },
        { q: "printf() 함수처럼 화면에 퍼센트(%)를 출력하려면?", a: "%%" },
        { q: "printf() 함수처럼 화면에 큰따옴표를 출력하려면?", a: "　\”　" },
        { q: "단 한개라도 거짓(F)?", a: "AND" },
        { q: "1,2,3,4처럼 셀 수 있는 숫자를 담을 수 있는 자료형을 나타내는 예약어는?", a: "정수형" },
        { q: "1.3,  23.34처럼 실수를 담을 수 있는 자료형을 나타내는 예약어는?", a: "실수형" },
        { q: "‘A’,’B’,’C’처럼 문자를 담을 수 있는 자료형을 나타내는 예약어는", a: "문자형" },
        { q: "int 정수형 서식문자는?", a: "%d" },
        { q: "float 실수형 서식문자는?", a: "%f" },
        { q: "char 문자형 서식문자는?", a: "%c" },
        { q: " 대입연산자는?", a: "=" },
        { q: " 나열연산자는?", a: "," },
        { q: "short형의 정수 출력할때 사용하는 서식문자는?", a: "%d" },
        { q: "%ld은 어떤 형일까요?", a: "long" },
        { q: "%lld은 어떤 형일까요?", a: "long long" },
        { q: "unsigned short는 어떤 서식문자는?", a: "%hu" },
        { q: "++ 연산자의 피연산자는?", a: "변수" },
        { q: "--피연산자는 숫자를 1만큰 증가 시킨후 다음 연산 수행을 한다?(네/아니요)", a: "아니요", },
        { q: "피연산자++ 모든 연산을 수행한 후 1만큼 증가 시키는가?(네/아니요)", a: "네", },
        { q: "rand() 함수를 사용할때 포함해야하 헤더파일의 이름은?", a: "stdlib.h", },
        { q: "작업을 중단하고 블록을 빠져나오는 예약어는?", a: "break", },
        { q: "switch문의 case 끔에 사용하는 기호는?", a: ":", },
        { q: "이후 실행문은 무시하고 다음번 반복으로 건너뛰는 예약어는?", a: "continue", },
        { q: "while문으로 무한반복을 구현하려면?", a: "while", },
    ]
};

let quiz = [], index = 0, score = 0, selected = null, mode = "mcq";
let time = 60, timer;
let wrong = [];

/* 버튼 생성 */
const list = document.getElementById("quizList");

Object.keys(quizzes).forEach(name => {
    const btn = document.createElement("button");
    btn.innerText = name;
    btn.onclick = () => start(name);
    list.appendChild(btn);
});

/* 시작 */
function start(name) {
    quiz = [...quizzes[name]];
    index = 0;
    score = 0;
    wrong = [];

    mode = (quiz[0].o) ? "mcq" : "text";

    show("quiz");
    load();
}

/* 문제 로드 */
function load() {
    selected = null;
    const q = quiz[index];

    document.getElementById("question").innerText = `Q${index + 1}. ${q.q}`;

    const box = document.getElementById("options");
    box.innerHTML = "";

    const feedback = document.getElementById("feedback");
    feedback.innerText = "";
    feedback.className = "";

    if (mode === "mcq") {
        q.o.forEach((v, i) => {
            let div = document.createElement("div");
            div.className = "option";
            div.innerText = v;

            div.onclick = () => {
                document.querySelectorAll(".option").forEach(o => o.classList.remove("selected"));
                div.classList.add("selected");
                selected = i;
            };

            box.appendChild(div);
        });
    } else {
        box.innerHTML = `<input id="answerInput" placeholder="답 입력">`;
        document.getElementById("answerInput")
            .addEventListener("keydown", e => {
                if (e.key === "Enter") next();
            });
    }

    startTimer();
}

/* 타이머 */
function startTimer() {
    clearInterval(timer);
    time = 60;
    document.getElementById("timer").innerText = `⏱ ${time}s`;

    timer = setInterval(() => {
        time--;
        document.getElementById("timer").innerText = `⏱ ${time}s`;

        if (time <= 0) {
            clearInterval(timer);
            next();
        }
    }, 1000);
}

/* 다음 */
function next() {
    clearInterval(timer);

    const q = quiz[index];
    let correct = false;

    if (mode === "mcq") {
        if (selected === null) return; // 선택 안 했으면 무시
        correct = selected === q.a;
    } else {
        let input = document.getElementById("answerInput").value.trim();
        if (!input) return;
        correct = input.toLowerCase() === q.a.toLowerCase();
    }

    const feedback = document.getElementById("feedback");

    if (correct) {
        score++;
        feedback.innerText = "✅ 정답!";
        feedback.className = "correct";
    } else {
        wrong.push(q);
        let answer = (mode === "mcq") ? q.o[q.a] : q.a;
        feedback.innerText = `❌ 오답! 정답: ${answer}`;
        feedback.className = "wrong";
    }

    // 선택지 색상 표시
    if (mode === "mcq") {
        document.querySelectorAll(".option").forEach((el, i) => {
            if (i === q.a) el.classList.add("correct");
            else if (i === selected) el.classList.add("wrong");
        });
    }

    // 자연스럽게 다음 문제
    setTimeout(() => {
        index++;
        if (index < quiz.length) {
            fadeOut(() => load());
        } else {
            finish();
        }
    }, 1200);
}

/* 결과 */
function finish() {
    show("result");

    let html = `${quiz.length}문제 중 ${score}개 맞음`;

    if (wrong.length > 0) {
        html += `<br><button onclick="retryWrong()">틀린 문제 다시 풀기</button>`;
    }

    document.getElementById("score").innerHTML = html;
}

/* 틀린 문제 다시 */
function retryWrong() {
    quiz = [...wrong];
    wrong = [];
    index = 0;
    score = 0;
    show("quiz");
    load();
}

/* 페이드 효과 */
function fadeOut(callback) {
    const qBox = document.getElementById("question");
    qBox.style.opacity = 0;

    setTimeout(() => {
        callback();
        qBox.style.opacity = 1;
    }, 200);
}

/* 화면 전환 */
function show(id) {
    ["start", "quiz", "result"].forEach(v => {
        document.getElementById(v).classList.add("hidden");
    });
    document.getElementById(id).classList.remove("hidden");
}

/* 처음 */
function restart() {
    show("start");
}
